case/outputs_mitigated/openfoam_cases/section_3_x30p4km/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 16.5298;

boundaryField
{
    inlet   { type fixedValue; value uniform 16.5298; }
    outlet  { type inletOutlet; inletValue uniform 16.5298; value uniform 16.5298; }
    walls   { type omegaWallFunction; value uniform 16.5298; }
}
