case/outputs_mitigated/openfoam_cases/section_3_x30p4km/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       58700;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       59200;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       59700;
    }
)

// ************************************************************************* //
